#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "neural.h"
#include "math base.h"



void 单层网络_线性传播(单层神经网络_t* 单层网络, double* 计算结果, double* 输入参数)
{
	for (unsigned int i = 0; i < (*单层网络).传出参数个数; i++)
	{
		计算结果[i] = 0;
		for (unsigned int j = 0; j < (*单层网络).传入参数个数; j++)
		{
			计算结果[i] += ((*单层网络).变换矩阵[i * ((*单层网络).传入参数个数 + 1) + j] * 输入参数[j]);
		}
		计算结果[i] += (*单层网络).变换矩阵[i * ((*单层网络).传入参数个数 + 1) + (*单层网络).传入参数个数];
	}
}

void 单层网络_传播(单层神经网络_t* 单层网络, double* 输入参数)
{
	double* 中间结果 = (double*)malloc((*单层网络).传出参数个数 * sizeof(double));
	单层网络_线性传播(单层网络, (*单层网络).该层参数值, 输入参数);
	(*单层网络).激励函数(
		中间结果,
		(*单层网络).该层参数值,
		(*单层网络).传出参数个数,
		NULL
	);
	free(中间结果);
}

神经网络_t* 新建神经网络(unsigned int 层数, unsigned int *各层参数个数, 激励函数_t *各层激励函数)
{
	神经网络_t* 网络 = (神经网络_t*)malloc(sizeof(神经网络_t));
	if (网络==NULL)
	{
		return NULL;
	}

	(*网络).层数 = 层数;
	(*网络).各层参数个数 = (unsigned int*)malloc((层数+1)*sizeof(unsigned int));
	(*网络).所有层 = (单层神经网络_t*)malloc(层数 * sizeof(单层神经网络_t));
	unsigned int 矩阵缓存个数 = 0;
	unsigned int 参数缓存个数 = 0;
	for (unsigned int i = 0; i < 层数; i++)
	{
		(*网络).各层参数个数[i]        = 各层参数个数[i];
		(*网络).所有层[i].传入参数个数 = 各层参数个数[i];
		(*网络).所有层[i].传出参数个数 = 各层参数个数[i+1];
		(*网络).所有层[i].激励函数     = 各层激励函数[i];
		//(*网络).所有层[i].变换矩阵     = (double*)矩阵缓存个数; // 当前数值为偏移量
		//(*网络).所有层[i].该层参数值   = (double*)参数缓存个数; // 当前数值为偏移量
		矩阵缓存个数 += (各层参数个数[i] + 1) * 各层参数个数[i+1];
		参数缓存个数 += 各层参数个数[i+1];
	}
	(*网络).各层参数个数[层数] = 各层参数个数[层数];
	(*网络).矩阵参数个数 = 矩阵缓存个数;
	double* 缓存池 = (double*)malloc((矩阵缓存个数 + 参数缓存个数) * sizeof(double));
	(*网络).缓存池 = 缓存池;
	double* 参数缓存池 = 缓存池 + 矩阵缓存个数;
	double* 当前矩阵缓存位置 = 缓存池;
	double* 当前参数缓存位置 = 参数缓存池;

	for (unsigned int i = 0; i < 层数; i++)
	{
		(*网络).所有层[i].变换矩阵   = 当前矩阵缓存位置; // 当前数值为偏移量
		(*网络).所有层[i].该层参数值 = 当前参数缓存位置; // 当前数值为偏移量
		当前矩阵缓存位置 += (((*网络).所有层[i].传入参数个数 + 1) * (*网络).所有层[i].传出参数个数);
		当前参数缓存位置 += (*网络).所有层[i].传出参数个数;
	}
	return 网络;
}




void 推理计算(神经网络_t* 网络, double* 输出结果, double* 输入参数)
{
	double* 当前层参数 = 输入参数;
	for (unsigned int i = 0; i < (*网络).层数; i++)
	{
		单层网络_传播(&(*网络).所有层[i], 当前层参数);
		当前层参数 = (*网络).所有层[i].该层参数值;
	}
	if(输出结果 != (*网络).所有层[(*网络).层数-1].该层参数值)
	{
		memcpy(输出结果, (*网络).所有层[(*网络).层数-1].该层参数值, (*网络).所有层[(*网络).层数-1].传出参数个数);
	}
}

double 评价函数(double* 矩阵参数, unsigned int 矩阵参数个数, void* 神经网络与训练集)
{
	/* 该函数不会进行匹配校验 */
	神经网络_t* 神经网络 = (神经网络_t*)(((void**)神经网络与训练集)[0]);
	训练集_t* 训练集     = (训练集_t*)  (((void**)神经网络与训练集)[1]);
	double* 推理结果 = (*神经网络).所有层[(*神经网络).层数-1].该层参数值;
	double 距离平方和 = 0;
	for (size_t i = 0; i < (*训练集).结果集数量; i++)
	{
		推理计算(神经网络, 推理结果, (*训练集).自变量数据集 + i * (*训练集).自变量单组长度);
		距离平方和 = 获取两点距离平方(推理结果, (*训练集).函数值数据集, (*训练集).函数值单组长度);
	}
	return 距离平方和;
}

void 训练(神经网络_t* 网络, 训练集_t* 训练集, unsigned int 训练轮数)
{
	unsigned int 神经网络输入长度 = (*网络).所有层[0].传入参数个数;
	unsigned int 神经网络输出长度 = (*网络).所有层[(*网络).层数-1].传出参数个数;
	if ((神经网络输入长度 != (*训练集).自变量单组长度) || (神经网络输出长度 != (*训练集).函数值单组长度))
	{
		puts("神经网络与数据集输入输出长度不匹配。");
		return;
	}
	void* 状态参数[2] = {(void*)网络, (void*)训练集};
	unsigned int 轮数分段[5] = { 0, 训练轮数/4, 训练轮数/2, (训练轮数*3)/4, 训练轮数};
	puts("开始训练");
	double 当前步长 = 128.0;
	for (size_t i = 0; i < 4; i++)
	{
		当前步长 = 梯度下降求解_本地修改(
			(*网络).缓存池,
			(*网络).矩阵参数个数,
			评价函数,
			(void*)状态参数,
			当前步长,
			轮数分段[i+1] - 轮数分段[i]
		);
		printf("训练进度：%i %%，当前步长：%g\n",25*(i+1), 当前步长);
		if(当前步长 < 1e-10)
		{
			puts("当前模型满足要求，退出训练");
			break;
		}
	}
	puts("训练完成");
}

void 销毁神经网络(神经网络_t* 网络)
{
	if (网络==NULL)
	{
		return;
	}
	free((*网络).各层参数个数);
	free((*网络).所有层);
	free((*网络).缓存池);
	free(网络);
}