#include <stddef.h>
#include <string.h>

#include "other.h"

static void 填充象限标签(double x, double y, double* 输出)
{
	unsigned int x_idx = ((x < 0) << 1) | (x > 0); 
	unsigned int y_idx = ((y < 0) << 1) | (y > 0); 

	static double 象限信息[4][4][4] = {
		{
			{ 0.25, 0.25, 0.25, 0.25 }, // x = 0, y = 0
			{ 0.5 , 0.5 , 0   , 0    }, // x = 0, y > 0
			{ 0   , 0   , 0.5 , 0.5  }, // x = 0, y < 0
			{ 0   , 0   , 0   , 0    }, // error
		}, // x = 0
		{
			{ 0.5 , 0   , 0   , 0.5  }, // x > 0, y = 0
			{ 1   , 0   , 0   , 0    }, // x > 0, y > 0
			{ 0   , 0   , 0   , 1    }, // x > 0, y < 0
			{ 0   , 0   , 0   , 0    }, // error
		}, // x > 0
		{
			{ 0   , 0.5 , 0.5 , 0    }, // x < 0, y = 0
			{ 0   , 1   , 0   , 0    }, // x < 0, y > 0
			{ 0   , 0   , 1   , 0    }, // x < 0, y < 0
			{ 0   , 0   , 0   , 0    }, // error
		}, // x < 0
		{
			{ 0, 0, 0, 0 }, // y = 0
			{ 0, 0, 0, 0 }, // y > 0
			{ 0, 0, 0, 0 }, // y < 0
			{ 0, 0, 0, 0 }, // error
		}, // 错误
	};

	memcpy(输出, 象限信息[x_idx][y_idx], 4 * sizeof(double));
}

static void 填充象限数据集(数据集_t* 数据集, int 步长)
{
	unsigned int 结果索引 = 0;
	(*数据集).自变量单组长度 = 2;
	(*数据集).函数值单组长度 = 4;

	for (int x = 坐标下限; x <= 坐标上限; x += 步长)
	{
		for (int y = 坐标下限; y <= 坐标上限; y += 步长)
		{
			double* 自变量 = 数据集_获取一组自变量参数(数据集, 结果索引);
			double* 函数值 = 数据集_获取一组函数值参数(数据集, 结果索引);
			自变量[0] = (double)x;
			自变量[1] = (double)y;
			填充象限标签((double)x, (double)y, 函数值);
			结果索引++;
		}
	}
}

void 填充训练集(数据集_t* 训练集)
{
	(*训练集).结果集数量 = 训练集长度;
	填充象限数据集(训练集, 训练步长);
}

void 填充推理集(数据集_t* 推理集)
{
	(*推理集).结果集数量 = 推理集长度;
	填充象限数据集(推理集, 推理步长);
}
