#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "neural.h"
#include "math base.h"

static unsigned int 计算矩阵池元素个数(unsigned int* 各层参数个数, unsigned int 层数);
static unsigned int 计算线性中间结果池元素个数(unsigned int* 各层参数个数, unsigned int 层数);
static double 评价函数(double* 矩阵参数, unsigned int 矩阵参数个数, void* 神经网络与训练集);


// 该函数仅用于训练，参数微调后对对应项目传播
// 修改一个矩阵列的参数[i][j]，用一个向量去乘它，结果向量只有第[i]个元素会变化
static double 单层网络_单行线性传播(单层神经网络_t* 单层网络, unsigned int 行号)
{
	double 计算结果 = 0;
	double* 行 = &((*单层网络).变换矩阵[行号 * ((*单层网络).传入参数个数 + 1)]);
	for (unsigned int j = 0; j < (*单层网络).传入参数个数; j++)
	{
		计算结果 += (行[j] * (*单层网络).该层传入数值[j]);
	}
	计算结果 += 行[(*单层网络).传入参数个数];
	return 计算结果;
}

// 没想好这个功能怎么做
//// 当向量只有第[j]个元素变化时，乘以一个不变的矩阵，只需计算[:][j]元素计算出来便可得到变化后的矩阵
//static void 单层网络_单列线性传播(double* 计算结果,单层神经网络_t* 单层网络, unsigned int 列号)
//{
//	计算结果[列号] = 0;
//	memcpy(计算结果, (*单层网络).该层线性数值, (*单层网络).传出参数个数 * sizeof(double));
//	for (unsigned int i = 0; i < (*单层网络).传出参数个数; i++)
//	{
//		(*单层网络).该层线性数值[i] = 0;
//		for (unsigned int j = 0; j < (*单层网络).传入参数个数; j++)
//		{
//			(*单层网络).该层线性数值[i] += ((*单层网络).变换矩阵[i * ((*单层网络).传入参数个数 + 1) + j] * (*单层网络).传入变量值[j]);
//		}
//		(*单层网络).该层线性数值[i] += (*单层网络).变换矩阵[i * ((*单层网络).传入参数个数 + 1) + (*单层网络).传入参数个数];
//	}
//	(*单层网络).该层线性数值[行号] += (*单层网络).变换矩阵[行号 * ((*单层网络).传入参数个数 + 1) + (*单层网络).传入参数个数];
//}

void 单层网络_线性变换(单层神经网络_t* 单层网络)
{
	for (unsigned int i = 0; i < (*单层网络).传出参数个数; i++)
	{
		(*单层网络).该层线性数值[i] = 0;
		for (unsigned int j = 0; j < (*单层网络).传入参数个数; j++)
		{
			(*单层网络).该层线性数值[i] += ((*单层网络).变换矩阵[i * ((*单层网络).传入参数个数 + 1) + j] * (*单层网络).该层传入数值[j]);
		}
		(*单层网络).该层线性数值[i] += (*单层网络).变换矩阵[i * ((*单层网络).传入参数个数 + 1) + (*单层网络).传入参数个数];
	}
}
void 单层网络_激励转化(单层神经网络_t* 单层网络)
{
	(*单层网络).激励函数(
		(*单层网络).该层激励数值,
		(*单层网络).该层线性数值,
		(*单层网络).传出参数个数,
		NULL
	);
}
void 单层网络_传播(单层神经网络_t* 单层网络)
{
	单层网络_线性变换(单层网络);
	单层网络_激励转化(单层网络);
}

神经网络_t* 新建神经网络(unsigned int 层数, unsigned int* 各层参数个数, 激励函数_t* 各层激励函数)
{
	unsigned int 神经网络对象大小 =
		sizeof(神经网络_t)                              // 核心对象
		+ (层数 + 1) * sizeof(unsigned int)             // 各层参数个数
		+ 层数 * sizeof(单层神经网络_t)                // 所有层
	;
	unsigned int 矩阵参数个数 = 计算矩阵池元素个数        (各层参数个数, 层数);
	unsigned int 中间结果个数 = 计算线性中间结果池元素个数(各层参数个数, 层数);
	unsigned int 总空间大小 = 神经网络对象大小 + (矩阵参数个数 + 中间结果个数) * sizeof(double);

	char* 申请内存 = (char*)malloc(总空间大小);
	if (申请内存 == NULL)
	{
		return NULL;
	}
	神经网络_t* 网络 = (神经网络_t*)申请内存;

	(*网络).层数         = 层数;
	(*网络).各层参数个数 = (unsigned int*)  (申请内存 + sizeof(神经网络_t));
	(*网络).所有层       = (单层神经网络_t*)(申请内存 + sizeof(神经网络_t) + (层数 + 1) * sizeof(unsigned int));
	(*网络).参数池       = (double*)(申请内存 + 神经网络对象大小);
	(*网络).总空间大小   = 神经网络对象大小 + (矩阵参数个数 + 中间结果个数) * sizeof(double);

	double* 矩阵参数指针 = (*网络).参数池;
	double* 数值缓存指针 = (*网络).参数池 + 矩阵参数个数;
	for (unsigned int i=0; i < 层数; i++)
	{
		(*网络).各层参数个数[i]        = 各层参数个数[i];
		(*网络).所有层[i].传入参数个数 = 各层参数个数[i];
		(*网络).所有层[i].传出参数个数 = 各层参数个数[i + 1];
		(*网络).所有层[i].激励函数     = 各层激励函数[i];
		(*网络).所有层[i].变换矩阵     = 矩阵参数指针;
		(*网络).所有层[i].该层线性数值 = 数值缓存指针;
		(*网络).所有层[i].该层激励数值 = 数值缓存指针 + 各层参数个数[i + 1];
		矩阵参数指针 += (各层参数个数[i] + 1) * 各层参数个数[i + 1];
		数值缓存指针 += (2 * 各层参数个数[i]);
	}
	(*网络).所有层[层数 - 1].该层激励数值 = NULL;

	(*网络).所有层[0].该层传入数值 = NULL;
	for (unsigned int i = 1; i < 层数; i++)
	{
		(*网络).所有层[i].该层传入数值 = (*网络).所有层[i - 1].该层激励数值;
	}

	return 网络;
}


void 神经网络_推理计算(神经网络_t* 网络, double* 输出结果, double* 输入参数)
{
	(*网络).所有层[0].该层传入数值 = 输入参数;
	(*网络).所有层[(*网络).层数 - 1].该层激励数值 = 输出结果;
	for (unsigned int i = 0; i < (*网络).层数; i++)
	{
		单层网络_传播(&(*网络).所有层[i]);
	}
	(*网络).所有层[0].该层传入数值 = NULL;
	(*网络).所有层[(*网络).层数 - 1].该层激励数值 = NULL;
}

typedef struct 调参迭代器
{
	神经网络_t* 网络;
	unsigned int 当前层数;
	unsigned int 当前参数行数;
	unsigned int 当前参数列数;
	double* 当前参数位置;
}调参迭代器;

static void 神经网络_单轮调参(double* 参数, 单层神经网络_t* 所在层, void* a)
{
}


void 神经网络_训练(神经网络_t* 网络, 数据集_t* 训练集, unsigned int 训练轮数)
{
	///* 训练集匹配性检测 */
	//if (!(((*训练集).自变量单组长度 == (*网络).各层参数个数[0]) && ((*训练集).函数值单组长度 == (*网络).各层参数个数[(*网络).层数 - 1])))
	//{
	//	puts("神经网络训练集");
	//	return;
	//}
	//
	///* 训练准备 */
	///* 缓冲区寄存 */
	//double** 旧缓冲区 = (double*)malloc(3 * (*网络).层数 * sizeof(double*));
	//double** 旧传入变量缓冲区 = 旧缓冲区;
	//double** 旧线性变量缓冲区 = 旧缓冲区 +     (*网络).层数;
	//double** 旧传出变量缓冲区 = 旧缓冲区 + 2 * (*网络).层数;
	//for (size_t i = 0; i < (*网络).层数; i++)
	//{
	//	旧传入变量缓冲区 = (*网络).所有层[i].该层传入数值;
	//	旧线性变量缓冲区 = (*网络).所有层[i].该层线性数值;
	//	旧传出变量缓冲区 = (*网络).所有层[i].该层激励数值;
	//}
	///* 新寄存变量缓冲区 */
	//unsigned int 单组数据缓冲区大小 = 计算线性中间结果池元素个数((*网络).各层参数个数, (*网络).层数);
	//
	//unsigned int 神经网络输入长度 = (*网络).所有层[0].传入参数个数;
	//unsigned int 神经网络输出长度 = (*网络).所有层[(*网络).层数 - 1].传出参数个数;
	//
	//if ((神经网络输入长度 != (*训练集).自变量单组长度) || (神经网络输出长度 != (*训练集).函数值单组长度))
	//{
	//	fputs("神经网络与数据集输入输出长度不匹配。", stderr);
	//	return;
	//}
	//void* 状态参数[2] = { (void*)网络, (void*)训练集 };
	//unsigned int 轮数分段[5] = { 0, 训练轮数 / 4, 训练轮数 / 2, (训练轮数 * 3) / 4, 训练轮数 };
	//puts("开始训练");
	//double 当前步长 = 128.0;
	//for (size_t i = 0; i < 4; i++)
	//{
	//	单轮调参();
	//}
	//puts("训练完成");
}

void 神经网络_销毁(神经网络_t* 网络)
{
	free((char*)网络);
}





// 辅助函数
static unsigned int 计算矩阵池元素个数(unsigned int* 各层参数个数, unsigned int 层数)
{
	unsigned int 结果 = 0;
	for (size_t i = 0; i < 层数; i++)
	{
		结果 += (各层参数个数[i] + 1) * 各层参数个数[i + 1];
	}
	return 结果;
}

static unsigned int 计算线性中间结果池元素个数(unsigned int* 各层参数个数, unsigned int 层数)
{
	unsigned int 结果 = 0;
	for (size_t i = 1; i < 层数; i++)
	{
		结果 += (2 * 各层参数个数[i]);
	}
	结果 += 各层参数个数[层数];
	return 结果;
}

static double 评价函数(double* 矩阵参数, unsigned int 矩阵参数个数, void* 神经网络与训练集)
{
	///* 该函数不会进行匹配校验 */
	//神经网络_t* 神经网络 = (神经网络_t*)(((void**)神经网络与训练集)[0]);
	//数据集_t* 训练集 = (数据集_t*)(((void**)神经网络与训练集)[1]);
	//double* 推理结果 = (*神经网络).所有层[(*神经网络).层数 - 1].该层激励数值;
	//double 距离平方和 = 0;
	//for (size_t i = 0; i < (*训练集).结果集数量; i++)
	//{
	//	推理计算(神经网络, 推理结果, (*训练集).自变量数据集 + i * (*训练集).自变量单组长度);
	//	距离平方和 = 获取两点距离平方(推理结果, (*训练集).函数值数据集, (*训练集).函数值单组长度);
	//}
	//return 距离平方和;
}