#include <stddef.h>

#include "other.h"

void 填充训练集(数据集_t* 训练集)
{
	(*训练集).自变量单组长度 = 1;
	(*训练集).函数值单组长度 = 1;
	(*训练集).结果集数量 = 训练集长度;
	for (size_t i = 0; i < 训练集长度; i++)
	{
		double x = i * 0.25;
		double* 自变量 = 数据集_获取一组自变量参数(训练集, i);
		double* 函数值 = 数据集_获取一组函数值参数(训练集, i);
		自变量[0] = x;
		函数值[0] = x * x;
	}
}

void 填充推理集(数据集_t* 推理集)
{
	(*推理集).自变量单组长度 = 1;
	(*推理集).函数值单组长度 = 1;
	(*推理集).结果集数量 = 推理集长度;
	for (size_t i = 0; i < 推理集长度; i++)
	{
		double x = i * 0.0625;
		double* 自变量 = 数据集_获取一组自变量参数(推理集, i);
		double* 函数值 = 数据集_获取一组函数值参数(推理集, i);
		自变量[0] = x;
		函数值[0] = x * x;
	}
}
